# Pandas

In [1]:
! pip install pandas

Requirement already satisfied: pandas in /Users/pulkitasri/opt/anaconda3/lib/python3.8/site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/pulkitasri/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /Users/pulkitasri/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in /Users/pulkitasri/opt/anaconda3/lib/python3.8/site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in /Users/pulkitasri/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

## Series -
#### 1-D Labeeled Array

In [3]:
books=["he","hey","hehehehehehehe"]

In [4]:
books=pd.Series(books)
books

0                he
1               hey
2    hehehehehehehe
dtype: object

In [5]:
books[2]

'hehehehehehehe'

In [6]:
books.index=["a","c","e"]

In [7]:
books

a                he
c               hey
e    hehehehehehehe
dtype: object

In [77]:
# books.index=["a","b","c","d"] ##error
# books.index=["a","b"] ##error

## DataFrames
#### 2-D Array index and column

In [10]:
import numpy as np

In [23]:
arr=np.random.randint(10,100,(6,4))
arr

array([[89, 25, 36, 42],
       [91, 90, 51, 29],
       [59, 18, 74, 36],
       [28, 83, 77, 94],
       [32, 20, 48, 19],
       [72, 11, 71, 60]])

In [32]:
df= pd.DataFrame(data=arr,columns=["a","b","c","d"])
df

    a   b   c   d
0  89  25  36  42
1  91  90  51  29
2  59  18  74  36
3  28  83  77  94
4  32  20  48  19
5  72  11  71  60

In [28]:
df[2] #Column Based .....Column First

0    36
1    51
2    74
3    77
4    48
5    71
Name: 2, dtype: int64

In [29]:
type(df[2])

pandas.core.series.Series

### We can Provide Column Names which is useful for tabular data

In [33]:
df.columns=["A","B","C","D"]
df

    A   B   C   D
0  89  25  36  42
1  91  90  51  29
2  59  18  74  36
3  28  83  77  94
4  32  20  48  19
5  72  11  71  60

In [31]:
df["D"]

0    42
1    29
2    36
3    94
4    19
5    60
Name: D, dtype: int64

In [37]:
df.head() ##First 5 rows
df.head(n=3) ## First 3 rows

    A   B   C   D
0  89  25  36  42
1  91  90  51  29
2  59  18  74  36

In [38]:
df.tail() ##last 5 rows
df.tail(n=3) ## last 3 rows

    A   B   C   D
3  28  83  77  94
4  32  20  48  19
5  72  11  71  60

In [40]:
cols=["A","B"]
df[cols]

    A   B
0  89  25
1  91  90
2  59  18
3  28  83
4  32  20
5  72  11

In [42]:
df[["B","A"]]

    B   A
0  25  89
1  90  91
2  18  59
3  83  28
4  20  32
5  11  72

In [55]:
## Add New Columns

df["A + B"]=df["A"]+ df["B"]
df

## Series + Series = Series(column)

    A   B   C  A + B
0  89  25  36    114
1  91  90  51    181
2  59  18  74     77
3  28  83  77    111
4  32  20  48     52
5  72  11  71     83

In [52]:
df.drop(columns=["A + B"]) ## Not Reference.... Df is unchanged
df

    A   B   C  A + B
0  89  25  36    114
1  91  90  51    181
2  59  18  74     77
3  28  83  77    111
4  32  20  48     52
5  72  11  71     83

In [53]:
df.drop(columns=["A + B"],inplace=True) ## Reference.... Df is Changes
df

    A   B   C
0  89  25  36
1  91  90  51
2  59  18  74
3  28  83  77
4  32  20  48
5  72  11  71

## Masking ....Boolean Indexing

In [62]:
mask=df>30
print(mask)
df[mask]

       A      B     C  A + B
0   True  False  True   True
1   True   True  True   True
2   True  False  True   True
3  False   True  True   True
4   True  False  True   True
5   True  False  True   True

      A     B   C  A + B
0  89.0   NaN  36    114
1  91.0  90.0  51    181
2  59.0   NaN  74     77
3   NaN  83.0  77    111
4  32.0   NaN  48     52
5  72.0   NaN  71     83

In [63]:
df[df > 20] #Basically All Cells Conditionally

    A     B   C  A + B
0  89  25.0  36    114
1  91  90.0  51    181
2  59   NaN  74     77
3  28  83.0  77    111
4  32   NaN  48     52
5  72   NaN  71     83

In [67]:
df["B"] > 20 
# Column Wise Masking......Only Rows Where B column >20
## SQL -> Select * from df where B>20


df[ df["B"] > 20 ]

    A   B   C  A + B
0  89  25  36    114
1  91  90  51    181
3  28  83  77    111

In [70]:
df[ df["B"] > 20 ][["C","A + B"]]
## Only C and A+B Columns 
## SQL -> Select C , A+B from df where B>20



##Conclusion
## var_df[<CONDITION>][<LIST_OF_COLUMNS>]

    C  A + B
0  36    114
1  51    181
3  77    111

In [72]:
df[ (df["B"] > 20) & (df["C"] > 40) ][["C","A + B"]]

    C  A + B
1  51    181
3  77    111

In [74]:
df_arr = df.values ##numpy Array
df_arr

array([[ 89,  25,  36, 114],
       [ 91,  90,  51, 181],
       [ 59,  18,  74,  77],
       [ 28,  83,  77, 111],
       [ 32,  20,  48,  52],
       [ 72,  11,  71,  83]])

## IRIS DATASET ....IMPORTING CSV

In [ ]:
iris=pd.read_csv("") #Relative Location

In [ ]:
iris.info

In [ ]:
iris.describe
## Count mean std min max 25% 50% 75%

In [ ]:
iris["SomeColumn"].nunique

In [ ]:
iris["SomeColumn"].unique

In [ ]:
iris["SomeColumn"].value_counts() 
##Group And show each unique value count
## Count(*) group by "SomeColumn"

In [ ]:
iris.sort_values(by=["SomeColumn","NextColumnIfSame"])

## Group By Objects and Functions

In [ ]:
iris.apply(lambda x:x+x)

In [ ]:
iris.aggregate("min")

In [ ]:
iris.aggregate(["min","max" ,"mean"])

In [ ]:
groupByObj = iris.groupBy("SomeColumn")

In [ ]:
groupByObj.min()
groupByObj.max()
groupByObj.count()
groupByObj.mean()
groupByObj.sum()
groupByObj.median()

In [ ]:
groupByObj.describe().T

In [ ]:
# NaN Values

In [ ]:
iris.isna()
iris.dropna()
iris.fillna(value=)